tap "nikitabobko/tap"
tap "FelixKratz/formulae"

# Command-line fuzzy finder written in Go
brew "fzf"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Janky borders
brew "borders"
# starship
brew "starship"
# presenterm
brew "presenterm"
# uv
brew "uv"
brew "gh"
# for setting chrome as default browser
brew "defaultbrowser"

# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Keystroke visualiser for recording demos
cask "keycastr"
# Nerdfont for exa and starship icons
cask "font-fira-code-nerd-font"
cask "claude-code"
cask "google-chrome"
cask "raycast"
cask "cursor"
cask "slack"
cask "kitty"
cask "ghostty"
cask "visual-studio-code"
cask "docker"

vscode "bradlc.vscode-tailwindcss"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
# watch can be used to run programs periodically 
vscode "prisma.prisma"brew "watch"
